InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеРабочихСтолов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеРабочихСтолов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачальныйРабочийСтол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстаревшийНачальныйСтол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийСтолРасчетчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийСтолДиспетчера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправлениеВзаимодействиями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийСтолПаспортиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтолСправок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыРабочихСтолов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыРабочихСтолов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальныйРабочийСтол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоризонтальныйРабочийСтол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтараяНачальнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийСтолДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеВзаимодействиями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийСтлоПаспортиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтолСправок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РС_СменитьСтол/Ext/Module.bsl
Процедура СменитьСтол(ВидРабочегоСтола = Неопределено) Экспорт
			
	Если ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол ИЛИ ВидРабочегоСтола = Неопределено Тогда 
		ЗаписатьПараметрыРабочегоСтола(Истина,,,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.ГоризонтальныйРабочийСтол Тогда
		ЗаписатьПараметрыРабочегоСтола(,Истина,,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтараяНачальнаяФорма Тогда
		ЗаписатьПараметрыРабочегоСтола(,,Истина,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтолДиспетчера Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,Истина,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.УправлениеВзаимодействиями Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,Истина,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтлоПаспортиста Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,,Истина,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтолСправок Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,,,Истина);
	КонецЕсли;
	
	ЗаписатьНастройки(ВидРабочегоСтола);
КонецПроцедуры

Процедура ЗаписатьНастройки (ВидРабочегоСтола) Экспорт
	
	Если ВидРабочегоСтола =Неопределено Тогда
		ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователи.АвторизованныйПользователь();
	НаборЗаписей.Отбор.Настройка.Использование = Истина;
	НаборЗаписей.Отбор.Настройка.Значение = ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол;
	
	Запись = НаборЗаписей.Добавить();

	Запись.Пользователь = Пользователи.АвторизованныйПользователь();
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол;
	Запись.Значение     = ВидРабочегоСтола;

			
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

Функция  ПолучитьНастройкиСтола(ВидРабочегоСтола = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиПользователей.Пользователь,
	               |	НастройкиПользователей.Настройка,
	               |	ЕСТЬNULL(НастройкиПользователей.Значение, """") КАК Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &Настройка";
	               
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат Результат.Значение

	

КонецФункции // ВозобновитьНастройкиСтола()


Процедура ЗаписатьПараметрыРабочегоСтола(НачальныйРабочийСтол = Ложь, РабочийСтолРасчетчика = Ложь, УстаревшийРабочийСтол = Ложь, РабочийСтолДиспетчера = Ложь, УправлениеВзаимодействиями = Ложь, РабочийСтолПаспортиста = Ложь, СтолСправок = Ложь)

	НаборЗаписей = РегистрыСведений.ХранилищеРабочихСтолов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователи.АвторизованныйПользователь();
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Пользователь = Пользователи.АвторизованныйПользователь();
	Запись.НачальныйРабочийСтол = НачальныйРабочийСтол;
	Запись.УстаревшийНачальныйСтол = УстаревшийРабочийСтол;
	Запись.РабочийСтолРасчетчика = РабочийСтолРасчетчика;
	Запись.РабочийСтолДиспетчера = РабочийСтолДиспетчера;
	Запись.РабочийСтолПаспортиста = РабочийСтолПаспортиста;
	Запись.УправлениеВзаимодействиями = УправлениеВзаимодействиями;
	Запись.СтолСправок = СтолСправок;
	
	НаборЗаписей.Записать();
	

КонецПроцедуры // ЗаписатьПараметрыРабочегоСтола()
